Frontend/js-array.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-12-13 周四 01:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>JS 对数组的常规操作</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">JS 对数组的常规操作</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org53b0772">1. 示例数据</a></li>
<li><a href="#org74ac78d">2. 基本问题</a></li>
<li><a href="#org4a64bbd">3. 问题一</a>
<ul>
<li><a href="#org0ded2f3">3.1. 使用 for 循环</a></li>
<li><a href="#org81287a7">3.2. 使用 forEach 循环（有两种形式）</a></li>
<li><a href="#orgb08ec3c">3.3. 使用 filter 方式实现</a></li>
</ul>
</li>
<li><a href="#org49a6be5">4. 问题二</a></li>
<li><a href="#org56e3537">5. 问题三</a>
<ul>
<li><a href="#org82a73ea">5.1. 首先，封装 getAge 方法:</a></li>
<li><a href="#orga03598d">5.2. 用 concat/map 方法实现</a></li>
<li><a href="#org1b4cf9e">5.3. 使用 ES6 语法实现</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-org53b0772" class="outline-2">
<h2 id="org53b0772"><span class="section-number-2">1</span> 示例数据</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-json">var array=[
  {
    id: <span class="org-constant">1</span>,
    name: 'ohzri',
    birth: '<span class="org-constant">1999.09</span>.<span class="org-constant">09</span>',
    city: '&#28246;&#21271;',
    salary: <span class="org-constant">3379</span>
  },
  {
    id: <span class="org-constant">2</span>,
    name: 'rqgfd',
    birth: '<span class="org-constant">1999.10</span>.<span class="org-constant">28</span>',
    city: '&#28246;&#21335;',
    salary: <span class="org-constant">4060</span>
  },
  {
    id: <span class="org-constant">3</span>,
    name: 'fwfsh',
    birth: '<span class="org-constant">1999.09</span>.<span class="org-constant">17</span>',
    city: '&#24191;&#35199;',
    salary: <span class="org-constant">3236</span>
  }
]
</pre>
</div>
</div>
</section>

<section id="outline-container-org74ac78d" class="outline-2">
<h2 id="org74ac78d"><span class="section-number-2">2</span> 基本问题</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>过滤，3000-3500之内的工资？</li>
<li>除去，湖南的城市。</li>
<li>修改，为每个人增加age字段。</li>
</ol>
</div>
</section>

<section id="outline-container-org4a64bbd" class="outline-2">
<h2 id="org4a64bbd"><span class="section-number-2">3</span> 问题一</h2>
<div class="outline-text-2" id="text-3">
<p>
可以用三种方法
</p>
</div>

<div id="outline-container-org0ded2f3" class="outline-3">
<h3 id="org0ded2f3"><span class="section-number-3">3.1</span> 使用 for 循环</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">arr1</span> = [];
<span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">i</span> = 0; i &lt; array.length; i++){
    <span class="org-keyword">if</span>(array[i].salary &gt;= 3000 &amp;&amp; array[i].salary &lt;= 3500){
        arr1.push(array[i]);
    };
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org81287a7" class="outline-3">
<h3 id="org81287a7"><span class="section-number-3">3.2</span> 使用 forEach 循环（有两种形式）</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">arr2</span> = [];
<span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">i</span> of array){
    <span class="org-keyword">if</span>(i.salary &gt;= 3000 &amp;&amp; i.salary &lt;=3500){
        arr2.push(i)
    }
}

<span class="org-keyword">var</span> <span class="org-variable-name">arr3</span> = [];
array.forEach(<span class="org-keyword">function</span>(<span class="org-variable-name">v</span>){
    <span class="org-keyword">if</span>(v.salary &gt;= 3000 &amp;&amp; v.salary &lt;=3500){
        arr3.push(v)
    }
})
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb08ec3c" class="outline-3">
<h3 id="orgb08ec3c"><span class="section-number-3">3.3</span> 使用 filter 方式实现</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">array1</span> = array.filter(<span class="org-keyword">function</span>(<span class="org-variable-name">v</span>) {
    <span class="org-keyword">return</span> v.salary &gt;= 3000 &amp;&amp; v.salary &lt;= 3500;
});

<span class="org-comment-delimiter">// </span><span class="org-comment">&#31616;&#20889;&#20026;:</span>
<span class="org-keyword">const</span> <span class="org-variable-name">array2</span> = array.filter(v =&gt; v.salary &gt;= 3000 &amp;&amp; v.salary &lt;= 3500);
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-org49a6be5" class="outline-2">
<h2 id="org49a6be5"><span class="section-number-2">4</span> 问题二</h2>
<div class="outline-text-2" id="text-4">
<p>
可以转换为上述的 filter 问题
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">arr4</span> = array.filter((v) =&gt; v.city != <span class="org-string">'&#28246;&#21335;'</span>);
console.log(arr4);
</pre>
</div>
</div>
</section>

<section id="outline-container-org56e3537" class="outline-2">
<h2 id="org56e3537"><span class="section-number-2">5</span> 问题三</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org82a73ea" class="outline-3">
<h3 id="org82a73ea"><span class="section-number-3">5.1</span> 首先，封装 getAge 方法:</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">getAge</span>(<span class="org-variable-name">birthday</span>){
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Date</span>().getYear() + 1900 - parseInt(birthday.substring(0, birthday.indexOf(<span class="org-string">'.'</span>)));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga03598d" class="outline-3">
<h3 id="orga03598d"><span class="section-number-3">5.2</span> 用 concat/map 方法实现</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">arr5</span> = array.concat();
<span class="org-keyword">for</span>(<span class="org-keyword">var</span> <span class="org-variable-name">i</span> of arr5){
    i.age = getAge(i.birth);
}

<span class="org-keyword">var</span> <span class="org-variable-name">arrayMap</span> = array.map((e) =&gt; {
    e.age = getAge(e.birth);
    <span class="org-keyword">return</span> e;
});
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b4cf9e" class="outline-3">
<h3 id="org1b4cf9e"><span class="section-number-3">5.3</span> 使用 ES6 语法实现</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-js"><span class="org-constant">this</span>.data = array.map(e =&gt; ({ ...e, age: getAge(e.birth) }));
</pre>
</div>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-12-13 周四 01:30</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
